// store.js
import Vue from 'vue';
import Vuex from 'vuex';

Vue.use(Vuex);

export const store = new Vuex.Store({
	state: {
		btnDisplay: false,
		categoryData: [
			'한식',
			'중식',
			'일식',
			'양식',
			'해장',
			'특식',
			'다이어트',
			'찌개',
			'면류',
			'국과탕',
			'덮밥',
			'전투식량',
			'간편식',
			'분식',
			'야식',
		],
		todayMealData: {
			한식: ['된장찌개', '보쌈정식', '아구찜'],
			중식: ['짬짜면', '탕수육', '팔보채'],
			일식: ['규동', '회초밥', '물회'],
			양식: ['스파게티', '햄버거', '피자'],
			해장: ['소머리국밥', '선지해장국'],
			특식: ['???', '김치전', '계란말이'],
			다이어트: ['삶은계란2개/아메리카노/닭가슴살', '닭가슴살', '???'],
			찌개: ['김치찌개', '갈치조림', '순두부찌개'],
			면류: ['김밥천국 라면', '일식 라멘', '편의점 컵라면', '짜장면', '짬뽕'],
			국과탕: ['무국', '순대국밥'],
			덮밥: ['김치덮밥', '육회비빔밥'],
			전투식량: ['편의점 컵라면/냉동 닭강정', '뽀글이'],
			간편식: ['한솥 도시락', '편의점 샌드위치'],
			분식: ['김밥/라면', '떡볶이/순대/튀김', '떡볶이/오뎅'],
			야식: ['보쌈', '족발', '쭈꾸미'],
		},
	},
});
